{
  "categories": {
    "code": {
      "content": "Introductory content for the code category.",
      "projects": [
        {
          "id": "3",
          "url": "shetreks",
          "title": "SheTreks",
          "description": "Connect with fellow solo female travelers and explore the world",
          "colour": "bg-secondary",
          "image": "https://raw.githubusercontent.com/estherphang/portfolio/main/public/shetreks.png",
          "what": "<p>SheTreks is an application designed for female solo travellers seeking camaraderie and adventure. It provides a platform for fellow female travellers to connect with like-minded individuals and participate in group activities. With SheTreks, travellers can effortlessly organise events and invite others to join them. Additionally, users can discover upcoming activities curated by fellow travellers and join in the fun.</p>",
          "whyTitle": "Why did we build SheTreks?",
          "why": "<p>As a solo female traveller, I understand the desire to connect with others and share experiences while on the road. </p>  <p>Existing travel apps often fail to cater to the needs of solo travellers, particularly in facilitating event organisation and participation. SheTreks fills this void by providing a comprehensive platform where travellers can connect and actively engage in travel experiences. By focusing on the female traveller demographic, SheTreks strives to cultivate a safe and inclusive community for women to explore, connect, and have fun.</p> <p>SheTreks was born out of the need to foster connections and create opportunities for shared adventures. By enabling users to organise and join events, SheTreks aims to make travel more accessible and cost-effective, especially for more enjoyable activities in groups.</p>",
          "how": "how",
          "role": "Software Developer",
          "subcontent1": "",
          "subcontent2": ""
        },
        {
          "id": "2",
          "url": "thrifty-and-co",
          "title": "Thrifty and Co",
          "description": "A financial app that helps you to track your budget and split your bills.",
          "colour": "bg-secondary",
          "image": "https://raw.githubusercontent.com/estherphang/portfolio/main/public/thriftyco.png",
          "what": "<p>Thrifty and Co is a financial app that helps you to track your budget and split your bills.</p>",
          "whyTitle": "Why did we build Thrifty and Co?",
          "why": "<p>I embarked on this project due to a common concern that many individuals, including myself, face: tracking expenses and understanding where our money goes by the end of each month. As I reflected on my financial habits, I realised how difficult it was to recall every expense, making it even harder to comprehend why I couldn't save as much as I desired.</p> <p>Specifically, remembering expenditure details for distinct categories such as transportation, food, and shopping proved to be quite daunting. I needed clarity to manage my finances effectively and plan for the future.</p><p>Recognising the widespread relevance of this issue, my teammate and I decided to tackle it head-on by developing Thrifty and Co, a financial app designed to address these challenges. In addition to tracking expenses and categorising them, we integrated a split bill function into the app. This addition stemmed from our observation that our age group frequently engages in activities like having lunch with colleagues or dining out with friends. We felt that having a feature to split bills effortlessly would significantly enhance the user experience and promote financial transparency among peers. </p><p>Therefore, we started this project to gain better insight into our personal finances and to provide a solution that could benefit others facing similar dilemmas in managing their expenses and social outings.</p>",
          "how": "how",
          "role": "Software Developer",
          "subcontent1": "",
          "subcontent2": ""
        },
        {
          "id": "1",
          "url": "kitt-it-up",
          "title": "Kitt It Up",
          "description": "Your Pomodoro Tracker with To-Do List",
          "colour": "bg-secondary",
          "image": "https://raw.githubusercontent.com/estherphang/portfolio/main/public/kittitup.png",
          "what": "<p>Kitt It Up is a powerful Pomodoro tracker integrated with a handy to-do list feature. This productivity tool is designed to keep you focused and on track with your tasks for dedicated time intervals. With Kitt It Up, you can easily customise your work and break durations according to your preference. For new users or when resetting the timer, the default setting is 25 minutes of work followed by a 5-minute break.</p>",
          "whyTitle": "Why did I build Kitt It Up?",
          "why": "<p>I initiated the development of Kitt It Up with a simple goal: to tackle the challenge of maintaining focus and motivation during work sessions. Like many individuals, I often struggle with mundane tasks and the temptation to procrastinate. The Pomodoro technique has proven to be an effective strategy for enhancing productivity and time management in my workflow. Additionally, I frequently struggle to remember all the tasks on my agenda. Thus, combining a to-do list with the Pomodoro technique emerged as a practical solution to address these common challenges.</p>",
          "role": "Software Developer",
          "subcontent1": "",
          "subcontent2": ""
        }
      ]
    },
    "marketing": {
      "content": "Introductory content for the marketing category.",
      "projects": [
        {
          "id": "2",
          "url": "panda-saves-money",
          "title": "Panda Saves Money",
          "description": "Marketing Campaign for Financial Literacy Comic Series",
          "colour": "bg-accent",
          "image": "https://raw.githubusercontent.com/estherphang/portfolio/main/public/panda-saves-money.png",
          "what": "<p>Panda Saves Money is a light-hearted comic series focused on nancial literacy. This engaging comic aims to educate Singaporeans on effective money-saving tips, smart investment strategies, and essential insurance knowledge. The content is posted on Instagram and Facebook.</p>",
          "whyTitle": "Why did we create Panda Saves Money? ",
          "why": "<p>The client decided to create content about financial literacy to address a significant gap she noticed among her clients. Many of them were eager to invest but lacked an understanding of how the economy and other external factors could impact their investments. Additionally, she observed that many people struggled with managing their money effectively. To bridge this gap, she envisioned creating educational content that would simplify complex financial concepts. Recognising my expertise in marketing and content creation, she approached me to bring this vision to life. This led to the creation of ‘Panda Saves Money’ a light-hearted comic series aimed at making financial literacy accessible and engaging for everyone.</p>",
          "role": "Content Creator, Illustrator and Marketing Consultant",
          "subcontent1": "",
          "subcontent2": ""
        },
        {
          "id": "1",
          "url": "SSEAYP-2015-singapore-contingent",
          "title": "SSEAYP 2015 Singapore Contingent",
          "description": "Branding campaign for the SSEAYP 2015 Singapore Contingent.",
          "colour": "bg-accent",
          "image": "https://raw.githubusercontent.com/estherphang/portfolio/main/public/sseayp-42-sg.png",
          "what": "<p>The Ship for Southeast Asian and Japanese Youth Programme (SSEAYP) is designed for youth aged 18 to 30 in ASEAN and Japan. The purpose of the program is to promote friendship and mutual understanding among the youths of Japan and the ten Southeast Asian countries, broaden their perspectives of the world, and strengthen their spirit of international cooperation and practical skills for international collaboration. Each year, around 27 youths from each country participate in the program. These participants create branding, performances, and activity materials representing their nation to share with the other participants.</p>",
          "whyTitle": "Crafting a Distinct Identity",
          "why": "<p>As the Marketing Director of the Singapore Contingent for the 42nd Batch of SSEAYP, my role involved crafting a distinct branding and social media identity for our contingent. Collaborating closely with my team, we conceptualized unique name cards that allowed each participating youth to showcase their individual identity. This personal touch not only fostered a sense of pride but also facilitated better interactions and networking among the participants.</p><p>One of my key contributions was designing the color theme of our uniform. We chose red to represent Singapore, reflecting the colors of our national flag, and complemented it with blue to symbolize trustworthiness and harmony. Additionally, I designed the logo for the Singapore Contingent. The ship in the logo represented the Nippon Maru, the vessel hosting the program, while the 28 windows symbolized each of the 28 participants. We also incorporated SG50 into the logo to celebrate Singapore’s 50th anniversary, with the sun motif representing a bright future.</p><p>In addition to these visual elements, I coordinated various marketing strategies to ensure our contingent's activities and achievements were effectively communicated. This included managing our social media platforms, creating engaging content, and highlighting key events and milestones throughout the program. Our goal was to not only promote our contingent but also to inspire and connect with a wider audience, sharing the values and experiences that SSEAYP fosters.</p><p>Through these efforts, we were able to create a cohesive and memorable identity for the Singapore Contingent, enhancing our presence within the SSEAYP community and beyond. The experience was incredibly rewarding, as it allowed me to leverage my skills in marketing and design to contribute to a meaningful international initiative.</p>",
          "role": "Marketing Director and Logo Designer",
          "subcontent1": "<img src=https://raw.githubusercontent.com/estherphang/portfolio/4a1cd297c294a9a8138c0f793831ea880de2fe10/public/sseayp-banner.svg>",
          "subcontent2": ""
        }
      ]
    },
    "design": {
      "content": "Introductory content for the design category.",
      "projects": [
        {
          "id": "3",
          "url": "smu-10th-anniversary",
          "title": "SMU 10th Anniversary",
          "description": "Campaign for the SMU SOL 10th Anniversary",
          "colour": "bg-purple",
          "image": "https://raw.githubusercontent.com/estherphang/portfolio/main/public/smu-sol-10th.png",
          "what": "<p>SMU School of Law celebrated its 10th anniversary. To commemorate this milestone, the school organised a series of events and produced a coffee table book.</p>",
          "whyTitle": "Celebrating a decade of excellence",
          "why": "<p>As part of the celebration, we were tasked to create a coffee table book to commemorate the past decade of the growth of the school, and to make path for the future. The committee would like to have a logo to commemorate the event, and I was tasked to create one. </p><p>Instead of using the full ‘0’ in the number ‘10’, I decided to incorporate the school’s library dome into the design. To create the dimension of the dome, i added the “th” of “10th” into the logo.",
          "role": "Logo Designer, Content Creator and Event Organiser",
          "subcontent1": "<img src=https://raw.githubusercontent.com/estherphang/portfolio/4a1cd297c294a9a8138c0f793831ea880de2fe10/public/sol-10.svg>",
          "subcontent2": ""
        },
        {
          "id": "2",
          "url": "smu-soe-newsletter",
          "title": "SMU SOE Newsletter",
          "description": "Revamping the SMU SOE Newsletter",
          "colour": "bg-purple",
          "image": "https://raw.githubusercontent.com/estherphang/portfolio/main/public/soenewsletter.png",
          "what": "<p>The SMU SOE Newsletter connects SMU with the SMU community and other stakeholders through updates on the school’s key events and stories of shared experiences.</p>",
          "whyTitle": "Why Revamp the SMU SOE Newsletter?",
          "why": "<p>As the designer of the SMU SOE Newsletter, my primary role was to transform its visual presentation. By revamping the newsletter, I aimed to make it more visually appealing and captivating for stakeholders. This redesign was crucial in increasing readership and fostering deeper engagement with the SMU community and other stakeholders. Through thoughtful design choices and visual enhancements, I sought to convey the school’s key events and shared experiences in a way that resonates and inspires.</p>",
          "role": "Designer",
          "subcontent1": "",
          "subcontent2": ""
        },
        {
          "id": "1",
          "url": "pet-portraits",
          "title": "Pet Portraits",
          "description": "Sketching pets to support charity",
          "colour": "bg-purple",
          "image": "https://raw.githubusercontent.com/estherphang/portfolio/main/public/pets-portraits.png",
          "what": "<p>I initiated this project in December 2020 to offer pet sketches for a small fee, with a portion of the proceeds benefiting a charity of my choice.</p>",
          "whyTitle": "Why did I start this project?",
          "why": "<p>I have always had a fondness for cats and wished to have one as a pet. However, due to circumstances beyond my control, I am unable to do so. Combining my passion for drawing with a desire to contribute to society, I launched this initiative as a means of giving back. </p><p>If you are interested in a portrait of your pet, please feel free to <a href='/contact' style='text-decoration: none; border-bottom: 3px solid #A2E0FA'>contact</a> me. I would be delighted to sketch your furry friend and support a good cause in the process.</p>",
          "role": "Illustrator",
          "subcontent1": "   ",
          "subcontent2": "<img src=https://raw.githubusercontent.com/estherphang/portfolio/4a1cd297c294a9a8138c0f793831ea880de2fe10/public/pets-2.svg> <img src=https://raw.githubusercontent.com/estherphang/portfolio/4a1cd297c294a9a8138c0f793831ea880de2fe10/public/pets-3.svg>"
        }
      ]
    }
  }
}
